In [111]:
from pathlib import Path
import numpy as np
import pandas as pd

import numpy as np
import matplotlib.pyplot as plt

from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report

In [112]:
#load the data file 
data = Path('train.csv')
titanic_df = pd.read_csv(data, index_col=0)
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
#drop NaaNs
titanic_df = titanic_df.dropna()
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [114]:
#drop unnecessary data fields
titanic_df = titanic_df.drop(['Name', 'Ticket', 'Cabin'], axis=1)
titanic_df.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
2                   1       1  female  38.0      1      0  71.2833        C
4                   1       1  female  35.0      1      0  53.1000        S
7                   0       1    male  54.0      0      0  51.8625        S
11                  1       3  female   4.0      1      1  16.7000        S
12                  1       1  female  58.0      0      0  26.5500        S

In [115]:
#encode non-numerical values 
titanic_encoded = pd.get_dummies(titanic_df, columns=
    ["Sex", 
     "Embarked" 
    ])
titanic_encoded.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,
2,1,1,38.0,1,0,71.2833,1,0,1,0,0
4,1,1,35.0,1,0,53.1000,1,0,0,0,1
7,0,1,54.0,0,0,51.8625,0,1,0,0,1
11,1,3,4.0,1,1,16.7000,1,0,0,0,1
12,1,1,58.0,0,0,26.5500,1,0,0,0,1

In [116]:
# Segment the features from the target
X = titanic_encoded.drop("Survived", axis=1)
y = titanic_encoded['Survived']

## SVM Model

In [117]:
# Use the train_test_split function to create training and testing subsets 
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=78, stratify=y)
X_train.shape

(137, 10)

In [118]:
# Instantiate a linear SVM model
from sklearn.svm import SVC 
titanic_svm_model = SVC(kernel='linear')

In [119]:
# Fit the data
titanic_svm_model.fit(X_train, y_train)

SVC(kernel='linear')

In [120]:
# Score the accuracy and print results

print(f'Training Data Score: {titanic_svm_model.score(X_train, y_train)}')
print(f'Testing Data Score: {titanic_svm_model.score(X_test,y_test)}')

Training Data Score: 0.7591240875912408
Testing Data Score: 0.8043478260869565

In [121]:
# Make predictions using the test data 
svm_predictions = titanic_svm_model.predict(X_test)
svm_results = pd.DataFrame({"Prediction": predictions, "Actual": y_test}).reset_index(drop=True)
svm_results.head(10)

   Prediction  Actual
0           1       1
1           1       1
2           1       1
3           0       1
4           1       1
5           1       0
6           1       1
7           0       1
8           1       0
9           1       1

In [122]:
#print the confusion matrix
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test, predictions)

array([[ 4, 11],
       [10, 21]], dtype=int64)

In [123]:
#print the classification report
from sklearn.metrics import classification_report
print(classification_report(y_test, predictions))

              precision    recall  f1-score   support

           0       0.29      0.27      0.28        15
           1       0.66      0.68      0.67        31

    accuracy                           0.54        46
   macro avg       0.47      0.47      0.47        46
weighted avg       0.54      0.54      0.54        46